nejcokorn/home-automation-firmware/STM32F103Rxv1.h
// CAN pins
#define CAN_RX PB_8
#define CAN_TX PB_9

// Device address selection
#define DEV_A1 PC_10
#define DEV_A2 PA_12
#define DEV_A3 PB_13
#define DEV_A4 PB_14
#define DEV_A5 PC_9

// Analog input pins
#define AI_01 PA_6
#define AI_02 PA_5
#define AI_03 PA_7
#define AI_04 PA_4

// Digital input pins
#define DI_01 PC_8
#define DI_02 PC_7
#define DI_03 PC_6
#define DI_04 PB_15
#define DI_05 PA_15
#define DI_06 PB_2 
#define DI_07 PC_4
#define DI_08 PC_5
#define DI_09 PB_3
#define DI_10 PD_2
#define DI_11 PC_12
#define DI_12 PC_11
#define DI_13 PC_3
#define DI_14 PC_2
#define DI_15 PC_1
#define DI_16 PC_0

// Digital output pins
#define DO_01 PA_1
#define DO_02 PA_3
#define DO_03 PB_1
#define DO_04 PB_0
#define DO_05 PA_0
#define DO_06 PA_2
#define DO_07 PA_9
#define DO_08 PA_8
#define DO_09 PB_4
#define DO_10 PB_5
#define DO_11 PA_11
#define DO_12 PA_10

// Configuration pins
#define C_01 PB_7
#define C_02 PB_6